In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
data = Series(['one','two',np.nan,'four'])

In [3]:
data

0     one
1     two
2     NaN
3    four
dtype: object

In [4]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
data.dropna

<bound method Series.dropna of 0     one
1     two
2     NaN
3    four
dtype: object>

In [6]:
data

0     one
1     two
2     NaN
3    four
dtype: object

In [7]:
data.dropna()

0     one
1     two
3    four
dtype: object

In [8]:
dframe = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])

In [9]:
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [11]:
clean_dframe = dframe.dropna()

In [12]:
clean_dframe

     0    1    2
0  1.0  2.0  3.0

In [13]:
dframe.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [14]:
dframe.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [15]:
npn = np.nan
dframe2 = DataFrame([[1,2,3,npn],[2,npn,5,6],[npn,7,npn,9],[1,npn,npn,npn]])
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [16]:
dframe2.dropna(thresh=2)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [17]:
dframe.fillna(1)

     0    1    2
0  1.0  2.0  3.0
1  1.0  5.0  6.0
2  7.0  1.0  9.0
3  1.0  1.0  1.0

In [18]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [19]:
dframe2.fillna({0:0,1:1,2:2,3:3})

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  1.0  5.0  6.0
2  0.0  7.0  2.0  9.0
3  1.0  1.0  2.0  3.0

In [20]:
dframe2.fillna(0,inplace = True)

In [21]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  2.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0

In [22]:
# Index Hierarchy

In [23]:
from numpy.random import randn

In [24]:
ser = Series(randn(6), index = [[1,1,1,2,2,2],['a','b','c','a','b','c']])

In [25]:
ser

1  a    1.774381
   b   -0.895591
   c    0.120981
2  a    0.281569
   b    0.842764
   c    0.062764
dtype: float64

In [26]:
ser.index

MultiIndex([(1, 'a'),
            (1, 'b'),
            (1, 'c'),
            (2, 'a'),
            (2, 'b'),
            (2, 'c')],
           )

In [27]:
ser[1]

a    1.774381
b   -0.895591
c    0.120981
dtype: float64

In [28]:
ser[:,'a']

1    1.774381
2    0.281569
dtype: float64

In [29]:
dframe = ser.unstack()

In [30]:
dframe

          a         b         c
1  1.774381 -0.895591  0.120981
2  0.281569  0.842764  0.062764

In [32]:
dframe2 = DataFrame(np.arange(16).reshape(4,4),index = [['a','a','b','b'],[1,2,1,2]],
                   columns =[['NY','NY','LA','SF'],['cold','hot','hot','cold']])
dframe2

      NY      LA   SF
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15

In [33]:
dframe2.index.names = ['INDEX_1','INDEX_2']
dframe2.columns.names = ['Cities','Temperature']

In [34]:
dframe2

Cities            NY      LA   SF
Temperature     cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [36]:
dframe2.swaplevel('Cities','Temperature',axis = 1)

Temperature     cold hot     cold
Cities            NY  NY  LA   SF
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [40]:
dframe2.sort_index(1)

C:\Users\sache\AppData\Local\Temp\ipykernel_40048\20702082.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.sort_index will be keyword-only.
  dframe2.sort_index(1)

Cities           LA   NY       SF
Temperature     hot cold hot cold
INDEX_1 INDEX_2
a       1         2    0   1    3
        2         6    4   5    7
b       1        10    8   9   11
        2        14   12  13   15

In [47]:
dframe2.sum(level = 'Temperature', axis =1 )

C:\Users\sache\AppData\Local\Temp\ipykernel_40048\1894301691.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  dframe2.sum(level = 'Temperature', axis =1 )

Temperature      cold  hot
INDEX_1 INDEX_2
a       1           3    3
        2          11   11
b       1          19   19
        2          27   27